Tekla Open API Reference for Tekla Structures 2025
EnumConverter Class
Type converter for Enum
Inheritance Hierarchy
System.Object
 System.ComponentModel.TypeConverter
 Tekla.Structures.Datatype.EnumConverter
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class EnumConverter : TypeConverter
Public Class EnumConverter
	Inherits TypeConverter
The EnumConverter type exposes the following members.
Constructors
Name | Description
EnumConverter
Initializes a new instance of the EnumConverter class
Top
Methods
Name | Description
CanConvertFrom |  (Overrides TypeConverter.CanConvertFrom(ITypeDescriptorContext, Type).)
CanConvertTo |  (Overrides TypeConverter.CanConvertTo(ITypeDescriptorContext, Type).)
ConvertFrom |  (Overrides TypeConverter.ConvertFrom(ITypeDescriptorContext, CultureInfo, Object).)
ConvertTo |  (Overrides TypeConverter.ConvertTo(ITypeDescriptorContext, CultureInfo, Object, Type).)
Top
See Also
Reference
Tekla.Structures.Datatype Namespace